package com.javarush.task.task04.task0430;

/*
От 1 до 10
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код

        int i = 1;
        while (i < 11) {

            System.out.println(i++);
        }

    }
}

/*Вывести на экран числа от 1 до 10 включительно, используя цикл while. Каждое значение с новой строки.

 */
/*
1
2
3
4
5
6
7
8
9
10

Process finished with exit code 0

 */