package com.javarush.task.task04.task0431;

/*
От 10 до 1
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int i = 11;
        while (i > 1) {
            i--;
            System.out.println(i);
        }
    }
}




/*Вывести на экран числа от 10 до 1 включительно, используя цикл while. Каждое значение с новой строки.

 */
/*
10
9
8
7
6
5
4
3
2
1

Process finished with exit code 0

 */