package com.javarush.task.task04.task0440;

/*
Достойная оплата труда
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        for (int i = 0; i < 100; i++) {
            System.out.println("Я никогда не буду работать за копейки. Амиго");
        }

    }
}


/*
Используя цикл вывести на экран сто раз надпись:
"Я никогда не буду работать за копейки. Амиго"
Каждое значение вывести с новой строки.
 */
/*
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго
Я никогда не буду работать за копейки. Амиго

Process finished with exit code 0
 */

